GopalSaraf/Practicals/PSDL/include/proc/pic16f18075.h
#define                                 D1S2_bit            _BIT_ACCESS(CLCnSEL0,2)
// CLCnSEL0<D1S3>
extern volatile __bit                   D1S3                __at(0x2C73);	// @ (0x58E * 8 + 3)
#define                                 D1S3_bit            _BIT_ACCESS(CLCnSEL0,3)
// CLCnSEL0<D1S4>
extern volatile __bit                   D1S4                __at(0x2C74);	// @ (0x58E * 8 + 4)
#define                                 D1S4_bit            _BIT_ACCESS(CLCnSEL0,4)
// CLCnSEL0<D1S5>
extern volatile __bit                   D1S5                __at(0x2C75);	// @ (0x58E * 8 + 5)
#define                                 D1S5_bit            _BIT_ACCESS(CLCnSEL0,5)
// CLCnSEL1<D2S0>
extern volatile __bit                   D2S0                __at(0x2C78);	// @ (0x58F * 8 + 0)
#define                                 D2S0_bit            _BIT_ACCESS(CLCnSEL1,0)
// CLCnSEL1<D2S1>
extern volatile __bit                   D2S1                __at(0x2C79);	// @ (0x58F * 8 + 1)
#define                                 D2S1_bit            _BIT_ACCESS(CLCnSEL1,1)
// CLCnSEL1<D2S2>
extern volatile __bit                   D2S2                __at(0x2C7A);	// @ (0x58F * 8 + 2)
#define                                 D2S2_bit            _BIT_ACCESS(CLCnSEL1,2)
// CLCnSEL1<D2S3>
extern volatile __bit                   D2S3                __at(0x2C7B);	// @ (0x58F * 8 + 3)
#define                                 D2S3_bit            _BIT_ACCESS(CLCnSEL1,3)
// CLCnSEL1<D2S4>
extern volatile __bit                   D2S4                __at(0x2C7C);	// @ (0x58F * 8 + 4)
#define                                 D2S4_bit            _BIT_ACCESS(CLCnSEL1,4)
// CLCnSEL1<D2S5>
extern volatile __bit                   D2S5                __at(0x2C7D);	// @ (0x58F * 8 + 5)
#define                                 D2S5_bit            _BIT_ACCESS(CLCnSEL1,5)
// CLCnSEL2<D3S0>
extern volatile __bit                   D3S0                __at(0x2C80);	// @ (0x590 * 8 + 0)
#define                                 D3S0_bit            _BIT_ACCESS(CLCnSEL2,0)
// CLCnSEL2<D3S1>
extern volatile __bit                   D3S1                __at(0x2C81);	// @ (0x590 * 8 + 1)
#define                                 D3S1_bit            _BIT_ACCESS(CLCnSEL2,1)
// CLCnSEL2<D3S2>
extern volatile __bit                   D3S2                __at(0x2C82);	// @ (0x590 * 8 + 2)
#define                                 D3S2_bit            _BIT_ACCESS(CLCnSEL2,2)
// CLCnSEL2<D3S3>
extern volatile __bit                   D3S3                __at(0x2C83);	// @ (0x590 * 8 + 3)
#define                                 D3S3_bit            _BIT_ACCESS(CLCnSEL2,3)
// CLCnSEL2<D3S4>
extern volatile __bit                   D3S4                __at(0x2C84);	// @ (0x590 * 8 + 4)
#define                                 D3S4_bit            _BIT_ACCESS(CLCnSEL2,4)
// CLCnSEL2<D3S5>
extern volatile __bit                   D3S5                __at(0x2C85);	// @ (0x590 * 8 + 5)
#define                                 D3S5_bit            _BIT_ACCESS(CLCnSEL2,5)
// CLCnSEL3<D4S0>
extern volatile __bit                   D4S0                __at(0x2C88);	// @ (0x591 * 8 + 0)
#define                                 D4S0_bit            _BIT_ACCESS(CLCnSEL3,0)
// CLCnSEL3<D4S1>
extern volatile __bit                   D4S1                __at(0x2C89);	// @ (0x591 * 8 + 1)
#define                                 D4S1_bit            _BIT_ACCESS(CLCnSEL3,1)
// CLCnSEL3<D4S2>
extern volatile __bit                   D4S2                __at(0x2C8A);	// @ (0x591 * 8 + 2)
#define                                 D4S2_bit            _BIT_ACCESS(CLCnSEL3,2)
// CLCnSEL3<D4S3>
extern volatile __bit                   D4S3                __at(0x2C8B);	// @ (0x591 * 8 + 3)
#define                                 D4S3_bit            _BIT_ACCESS(CLCnSEL3,3)
// CLCnSEL3<D4S4>
extern volatile __bit                   D4S4                __at(0x2C8C);	// @ (0x591 * 8 + 4)
#define                                 D4S4_bit            _BIT_ACCESS(CLCnSEL3,4)
// CLCnSEL3<D4S5>
extern volatile __bit                   D4S5                __at(0x2C8D);	// @ (0x591 * 8 + 5)
#define                                 D4S5_bit            _BIT_ACCESS(CLCnSEL3,5)
// SSP1STAT<DA1>
extern volatile __bit                   DA1                 __at(0x347D);	// @ (0x68F * 8 + 5)
#define                                 DA1_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DA2>
extern volatile __bit                   DA2                 __at(0x34CD);	// @ (0x699 * 8 + 5)
#define                                 DA2_bit             _BIT_ACCESS(SSP2STAT,5)
// CWG1ISM<DAT0>
extern volatile __bit                   DAT0                __at(0x2868);	// @ (0x50D * 8 + 0)
#define                                 DAT0_bit            _BIT_ACCESS(CWG1ISM,0)
// CWG1ISM<DAT1>
extern volatile __bit                   DAT1                __at(0x2869);	// @ (0x50D * 8 + 1)
#define                                 DAT1_bit            _BIT_ACCESS(CWG1ISM,1)
// CWG1ISM<DAT2>
extern volatile __bit                   DAT2                __at(0x286A);	// @ (0x50D * 8 + 2)
#define                                 DAT2_bit            _BIT_ACCESS(CWG1ISM,2)
// CWG1ISM<DAT3>
extern volatile __bit                   DAT3                __at(0x286B);	// @ (0x50D * 8 + 3)
#define                                 DAT3_bit            _BIT_ACCESS(CWG1ISM,3)
// SSP1STAT<DATA_ADDRESS1>
extern volatile __bit                   DATA_ADDRESS1       __at(0x347D);	// @ (0x68F * 8 + 5)
#define                                 DATA_ADDRESS1_bit   _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DATA_ADDRESS2>
extern volatile __bit                   DATA_ADDRESS2       __at(0x34CD);	// @ (0x699 * 8 + 5)
#define                                 DATA_ADDRESS2_bit   _BIT_ACCESS(SSP2STAT,5)
// CWG1DBF<DBF0>
extern volatile __bit                   DBF0                __at(0x2878);	// @ (0x50F * 8 + 0)
#define                                 DBF0_bit            _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<DBF1>
extern volatile __bit                   DBF1                __at(0x2879);	// @ (0x50F * 8 + 1)
#define                                 DBF1_bit            _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<DBF2>
extern volatile __bit                   DBF2                __at(0x287A);	// @ (0x50F * 8 + 2)
#define                                 DBF2_bit            _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<DBF3>
extern volatile __bit                   DBF3                __at(0x287B);	// @ (0x50F * 8 + 3)
#define                                 DBF3_bit            _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<DBF4>
extern volatile __bit                   DBF4                __at(0x287C);	// @ (0x50F * 8 + 4)
#define                                 DBF4_bit            _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<DBF5>
extern volatile __bit                   DBF5                __at(0x287D);	// @ (0x50F * 8 + 5)
#define                                 DBF5_bit            _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<DBR0>
extern volatile __bit                   DBR0                __at(0x2870);	// @ (0x50E * 8 + 0)
#define                                 DBR0_bit            _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<DBR1>
extern volatile __bit                   DBR1                __at(0x2871);	// @ (0x50E * 8 + 1)
#define                                 DBR1_bit            _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<DBR2>
extern volatile __bit                   DBR2                __at(0x2872);	// @ (0x50E * 8 + 2)
#define                                 DBR2_bit            _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<DBR3>
extern volatile __bit                   DBR3                __at(0x2873);	// @ (0x50E * 8 + 3)
#define                                 DBR3_bit            _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<DBR4>
extern volatile __bit                   DBR4                __at(0x2874);	// @ (0x50E * 8 + 4)
#define                                 DBR4_bit            _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<DBR5>
extern volatile __bit                   DBR5                __at(0x2875);	// @ (0x50E * 8 + 5)
#define                                 DBR5_bit            _BIT_ACCESS(CWG1DBR,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0xE930);	// @ (0x1D26 * 8 + 0)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,0)
// ADCON1<DSEN>
extern volatile __bit                   DSEN                __at(0xE938);	// @ (0x1D27 * 8 + 0)
#define                                 DSEN_bit            _BIT_ACCESS(ADCON1,0)
// SSP1STAT<D_A1>
extern volatile __bit                   D_A1                __at(0x347D);	// @ (0x68F * 8 + 5)
#define                                 D_A1_bit            _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<D_A2>
extern volatile __bit                   D_A2                __at(0x34CD);	// @ (0x699 * 8 + 5)
#define                                 D_A2_bit            _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<D_nA1>
extern volatile __bit                   D_nA1               __at(0x347D);	// @ (0x68F * 8 + 5)
#define                                 D_nA1_bit           _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<D_nA2>
extern volatile __bit                   D_nA2               __at(0x34CD);	// @ (0x699 * 8 + 5)
#define                                 D_nA2_bit           _BIT_ACCESS(SSP2STAT,5)
// ADERRL<ERR0>
extern volatile __bit                   ERR0                __at(0xE880);	// @ (0x1D10 * 8 + 0)
#define                                 ERR0_bit            _BIT_ACCESS(ADERRL,0)
// ADERRL<ERR1>
extern volatile __bit                   ERR1                __at(0xE881);	// @ (0x1D10 * 8 + 1)
#define                                 ERR1_bit            _BIT_ACCESS(ADERRL,1)
// ADERRH<ERR10>
extern volatile __bit                   ERR10               __at(0xE88A);	// @ (0x1D11 * 8 + 2)
#define                                 ERR10_bit           _BIT_ACCESS(ADERRH,2)
// ADERRH<ERR11>
extern volatile __bit                   ERR11               __at(0xE88B);	// @ (0x1D11 * 8 + 3)
#define                                 ERR11_bit           _BIT_ACCESS(ADERRH,3)
// ADERRH<ERR12>
extern volatile __bit                   ERR12               __at(0xE88C);	// @ (0x1D11 * 8 + 4)
#define                                 ERR12_bit           _BIT_ACCESS(ADERRH,4)
// ADERRH<ERR13>
extern volatile __bit                   ERR13               __at(0xE88D);	// @ (0x1D11 * 8 + 5)
#define                                 ERR13_bit           _BIT_ACCESS(ADERRH,5)
// ADERRH<ERR14>
extern volatile __bit                   ERR14               __at(0xE88E);	// @ (0x1D11 * 8 + 6)
#define                                 ERR14_bit           _BIT_ACCESS(ADERRH,6)
// ADERRH<ERR15>
extern volatile __bit                   ERR15               __at(0xE88F);	// @ (0x1D11 * 8 + 7)
#define                                 ERR15_bit           _BIT_ACCESS(ADERRH,7)
// ADERRL<ERR2>
extern volatile __bit                   ERR2                __at(0xE882);	// @ (0x1D10 * 8 + 2)
#define                                 ERR2_bit            _BIT_ACCESS(ADERRL,2)
// ADERRL<ERR3>
extern volatile __bit                   ERR3                __at(0xE883);	// @ (0x1D10 * 8 + 3)
#define                                 ERR3_bit            _BIT_ACCESS(ADERRL,3)
// ADERRL<ERR4>
extern volatile __bit                   ERR4                __at(0xE884);	// @ (0x1D10 * 8 + 4)
#define                                 ERR4_bit            _BIT_ACCESS(ADERRL,4)
// ADERRL<ERR5>
extern volatile __bit                   ERR5                __at(0xE885);	// @ (0x1D10 * 8 + 5)
#define                                 ERR5_bit            _BIT_ACCESS(ADERRL,5)
// ADERRL<ERR6>
extern volatile __bit                   ERR6                __at(0xE886);	// @ (0x1D10 * 8 + 6)
#define                                 ERR6_bit            _BIT_ACCESS(ADERRL,6)
// ADERRL<ERR7>
extern volatile __bit                   ERR7                __at(0xE887);	// @ (0x1D10 * 8 + 7)
#define                                 ERR7_bit            _BIT_ACCESS(ADERRL,7)
// ADERRH<ERR8>
extern volatile __bit                   ERR8                __at(0xE888);	// @ (0x1D11 * 8 + 0)
#define                                 ERR8_bit            _BIT_ACCESS(ADERRH,0)
// ADERRH<ERR9>
extern volatile __bit                   ERR9                __at(0xE889);	// @ (0x1D11 * 8 + 1)
#define                                 ERR9_bit            _BIT_ACCESS(ADERRH,1)
// ADFLTRL<FLTR0>
extern volatile __bit                   FLTR0               __at(0xE8A0);	// @ (0x1D14 * 8 + 0)
#define                                 FLTR0_bit           _BIT_ACCESS(ADFLTRL,0)
// ADFLTRL<FLTR1>
extern volatile __bit                   FLTR1               __at(0xE8A1);	// @ (0x1D14 * 8 + 1)
#define                                 FLTR1_bit           _BIT_ACCESS(ADFLTRL,1)
// ADFLTRH<FLTR10>
extern volatile __bit                   FLTR10              __at(0xE8AA);	// @ (0x1D15 * 8 + 2)
#define                                 FLTR10_bit          _BIT_ACCESS(ADFLTRH,2)
// ADFLTRH<FLTR11>
extern volatile __bit                   FLTR11              __at(0xE8AB);	// @ (0x1D15 * 8 + 3)
#define                                 FLTR11_bit          _BIT_ACCESS(ADFLTRH,3)
// ADFLTRH<FLTR12>
extern volatile __bit                   FLTR12              __at(0xE8AC);	// @ (0x1D15 * 8 + 4)
#define                                 FLTR12_bit          _BIT_ACCESS(ADFLTRH,4)
// ADFLTRH<FLTR13>
extern volatile __bit                   FLTR13              __at(0xE8AD);	// @ (0x1D15 * 8 + 5)
#define                                 FLTR13_bit          _BIT_ACCESS(ADFLTRH,5)
// ADFLTRH<FLTR14>
extern volatile __bit                   FLTR14              __at(0xE8AE);	// @ (0x1D15 * 8 + 6)
#define                                 FLTR14_bit          _BIT_ACCESS(ADFLTRH,6)
// ADFLTRH<FLTR15>
extern volatile __bit                   FLTR15              __at(0xE8AF);	// @ (0x1D15 * 8 + 7)
#define                                 FLTR15_bit          _BIT_ACCESS(ADFLTRH,7)
// ADFLTRL<FLTR2>
extern volatile __bit                   FLTR2               __at(0xE8A2);	// @ (0x1D14 * 8 + 2)
#define                                 FLTR2_bit           _BIT_ACCESS(ADFLTRL,2)
// ADFLTRL<FLTR3>
extern volatile __bit                   FLTR3               __at(0xE8A3);	// @ (0x1D14 * 8 + 3)
#define                                 FLTR3_bit           _BIT_ACCESS(ADFLTRL,3)
// ADFLTRL<FLTR4>
extern volatile __bit                   FLTR4               __at(0xE8A4);	// @ (0x1D14 * 8 + 4)
#define                                 FLTR4_bit           _BIT_ACCESS(ADFLTRL,4)
// ADFLTRL<FLTR5>
extern volatile __bit                   FLTR5               __at(0xE8A5);	// @ (0x1D14 * 8 + 5)
#define                                 FLTR5_bit           _BIT_ACCESS(ADFLTRL,5)
// ADFLTRL<FLTR6>
extern volatile __bit                   FLTR6               __at(0xE8A6);	// @ (0x1D14 * 8 + 6)
#define                                 FLTR6_bit           _BIT_ACCESS(ADFLTRL,6)
// ADFLTRL<FLTR7>
extern volatile __bit                   FLTR7               __at(0xE8A7);	// @ (0x1D14 * 8 + 7)
#define                                 FLTR7_bit           _BIT_ACCESS(ADFLTRL,7)
// ADFLTRH<FLTR8>
extern volatile __bit                   FLTR8               __at(0xE8A8);	// @ (0x1D15 * 8 + 0)
#define                                 FLTR8_bit           _BIT_ACCESS(ADFLTRH,0)
// ADFLTRH<FLTR9>
extern volatile __bit                   FLTR9               __at(0xE8A9);	// @ (0x1D15 * 8 + 1)
#define                                 FLTR9_bit           _BIT_ACCESS(ADFLTRH,1)
// ADCON0<FM0>
extern volatile __bit                   FM0                 __at(0xE932);	// @ (0x1D26 * 8 + 2)
#define                                 FM0_bit             _BIT_ACCESS(ADCON0,2)
// NVMCON1<FREE>
extern volatile __bit                   FREE                __at(0xE484);	// @ (0x1C90 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(NVMCON1,4)
// OSCFRQ<FRQ0>
extern volatile __bit                   FRQ0                __at(0x1098);	// @ (0x213 * 8 + 0)
#define                                 FRQ0_bit            _BIT_ACCESS(OSCFRQ,0)
// OSCFRQ<FRQ1>
extern volatile __bit                   FRQ1                __at(0x1099);	// @ (0x213 * 8 + 1)
#define                                 FRQ1_bit            _BIT_ACCESS(OSCFRQ,1)
// OSCFRQ<FRQ2>
extern volatile __bit                   FRQ2                __at(0x109A);	// @ (0x213 * 8 + 2)
#define                                 FRQ2_bit            _BIT_ACCESS(OSCFRQ,2)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x8067);	// @ (0x100C * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x8066);	// @ (0x100C * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// CLCnGLS0<G1D1N>
extern volatile __bit                   G1D1N               __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 G1D1N_bit           _BIT_ACCESS(CLCnGLS0,0)
// CLCnGLS0<G1D1T>
extern volatile __bit                   G1D1T               __at(0x2C91);	// @ (0x592 * 8 + 1)
#define                                 G1D1T_bit           _BIT_ACCESS(CLCnGLS0,1)
// CLCnGLS0<G1D2N>
extern volatile __bit                   G1D2N               __at(0x2C92);	// @ (0x592 * 8 + 2)
#define                                 G1D2N_bit           _BIT_ACCESS(CLCnGLS0,2)
// CLCnGLS0<G1D2T>
extern volatile __bit                   G1D2T               __at(0x2C93);	// @ (0x592 * 8 + 3)
#define                                 G1D2T_bit           _BIT_ACCESS(CLCnGLS0,3)
// CLCnGLS0<G1D3N>
extern volatile __bit                   G1D3N               __at(0x2C94);	// @ (0x592 * 8 + 4)
#define                                 G1D3N_bit           _BIT_ACCESS(CLCnGLS0,4)
// CLCnGLS0<G1D3T>
extern volatile __bit                   G1D3T               __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 G1D3T_bit           _BIT_ACCESS(CLCnGLS0,5)
// CLCnGLS0<G1D4N>
extern volatile __bit                   G1D4N               __at(0x2C96);	// @ (0x592 * 8 + 6)
#define                                 G1D4N_bit           _BIT_ACCESS(CLCnGLS0,6)
// CLCnGLS0<G1D4T>
extern volatile __bit                   G1D4T               __at(0x2C97);	// @ (0x592 * 8 + 7)
#define                                 G1D4T_bit           _BIT_ACCESS(CLCnGLS0,7)
// CWG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0x2887);	// @ (0x510 * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(CWG1CON0,7)
// CLCnPOL<G1POL>
extern volatile __bit                   G1POL               __at(0x2C68);	// @ (0x58D * 8 + 0)
#define                                 G1POL_bit           _BIT_ACCESS(CLCnPOL,0)
// CLCnGLS1<G2D1N>
extern volatile __bit                   G2D1N               __at(0x2C98);	// @ (0x593 * 8 + 0)
#define                                 G2D1N_bit           _BIT_ACCESS(CLCnGLS1,0)
// CLCnGLS1<G2D1T>
extern volatile __bit                   G2D1T               __at(0x2C99);	// @ (0x593 * 8 + 1)
#define                                 G2D1T_bit           _BIT_ACCESS(CLCnGLS1,1)
// CLCnGLS1<G2D2N>
extern volatile __bit                   G2D2N               __at(0x2C9A);	// @ (0x593 * 8 + 2)
#define                                 G2D2N_bit           _BIT_ACCESS(CLCnGLS1,2)
// CLCnGLS1<G2D2T>
extern volatile __bit                   G2D2T               __at(0x2C9B);	// @ (0x593 * 8 + 3)
#define                                 G2D2T_bit           _BIT_ACCESS(CLCnGLS1,3)
// CLCnGLS1<G2D3N>
extern volatile __bit                   G2D3N               __at(0x2C9C);	// @ (0x593 * 8 + 4)
#define                                 G2D3N_bit           _BIT_ACCESS(CLCnGLS1,4)
// CLCnGLS1<G2D3T>
extern volatile __bit                   G2D3T               __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 G2D3T_bit           _BIT_ACCESS(CLCnGLS1,5)
// CLCnGLS1<G2D4N>
extern volatile __bit                   G2D4N               __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 G2D4N_bit           _BIT_ACCESS(CLCnGLS1,6)
// CLCnGLS1<G2D4T>
extern volatile __bit                   G2D4T               __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 G2D4T_bit           _BIT_ACCESS(CLCnGLS1,7)
// CLCnPOL<G2POL>
extern volatile __bit                   G2POL               __at(0x2C69);	// @ (0x58D * 8 + 1)
#define                                 G2POL_bit           _BIT_ACCESS(CLCnPOL,1)
// CLCnGLS2<G3D1N>
extern volatile __bit                   G3D1N               __at(0x2CA0);	// @ (0x594 * 8 + 0)
#define                                 G3D1N_bit           _BIT_ACCESS(CLCnGLS2,0)
// CLCnGLS2<G3D1T>
extern volatile __bit                   G3D1T               __at(0x2CA1);	// @ (0x594 * 8 + 1)
#define                                 G3D1T_bit           _BIT_ACCESS(CLCnGLS2,1)
// CLCnGLS2<G3D2N>
extern volatile __bit                   G3D2N               __at(0x2CA2);	// @ (0x594 * 8 + 2)
#define                                 G3D2N_bit           _BIT_ACCESS(CLCnGLS2,2)
// CLCnGLS2<G3D2T>
extern volatile __bit                   G3D2T               __at(0x2CA3);	// @ (0x594 * 8 + 3)
#define                                 G3D2T_bit           _BIT_ACCESS(CLCnGLS2,3)
// CLCnGLS2<G3D3N>
extern volatile __bit                   G3D3N               __at(0x2CA4);	// @ (0x594 * 8 + 4)
#define                                 G3D3N_bit           _BIT_ACCESS(CLCnGLS2,4)
// CLCnGLS2<G3D3T>
extern volatile __bit                   G3D3T               __at(0x2CA5);	// @ (0x594 * 8 + 5)
#define                                 G3D3T_bit           _BIT_ACCESS(CLCnGLS2,5)
// CLCnGLS2<G3D4N>
extern volatile __bit                   G3D4N               __at(0x2CA6);	// @ (0x594 * 8 + 6)
#define                                 G3D4N_bit           _BIT_ACCESS(CLCnGLS2,6)
// CLCnGLS2<G3D4T>
extern volatile __bit                   G3D4T               __at(0x2CA7);	// @ (0x594 * 8 + 7)
#define                                 G3D4T_bit           _BIT_ACCESS(CLCnGLS2,7)
// CLCnPOL<G3POL>
extern volatile __bit                   G3POL               __at(0x2C6A);	// @ (0x58D * 8 + 2)
#define                                 G3POL_bit           _BIT_ACCESS(CLCnPOL,2)
// CLCnGLS3<G4D1N>
extern volatile __bit                   G4D1N               __at(0x2CA8);	// @ (0x595 * 8 + 0)
#define                                 G4D1N_bit           _BIT_ACCESS(CLCnGLS3,0)
// CLCnGLS3<G4D1T>
extern volatile __bit                   G4D1T               __at(0x2CA9);	// @ (0x595 * 8 + 1)
#define                                 G4D1T_bit           _BIT_ACCESS(CLCnGLS3,1)
// CLCnGLS3<G4D2N>
extern volatile __bit                   G4D2N               __at(0x2CAA);	// @ (0x595 * 8 + 2)
#define                                 G4D2N_bit           _BIT_ACCESS(CLCnGLS3,2)
// CLCnGLS3<G4D2T>
extern volatile __bit                   G4D2T               __at(0x2CAB);	// @ (0x595 * 8 + 3)
#define                                 G4D2T_bit           _BIT_ACCESS(CLCnGLS3,3)
// CLCnGLS3<G4D3N>
extern volatile __bit                   G4D3N               __at(0x2CAC);	// @ (0x595 * 8 + 4)
#define                                 G4D3N_bit           _BIT_ACCESS(CLCnGLS3,4)
// CLCnGLS3<G4D3T>
extern volatile __bit                   G4D3T               __at(0x2CAD);	// @ (0x595 * 8 + 5)
#define                                 G4D3T_bit           _BIT_ACCESS(CLCnGLS3,5)
// CLCnGLS3<G4D4N>
extern volatile __bit                   G4D4N               __at(0x2CAE);	// @ (0x595 * 8 + 6)
