GopalSaraf/Practicals/PSDL/include/proc/pic16f18075.h
#define                                 ODCD6_bit           _BIT_ACCESS(ODCOND,6)
// ODCOND<ODCD7>
extern volatile __bit                   ODCD7               __at(0xF567);	// @ (0x1EAC * 8 + 7)
#define                                 ODCD7_bit           _BIT_ACCESS(ODCOND,7)
// ODCONE<ODCE0>
extern volatile __bit                   ODCE0               __at(0xF5B0);	// @ (0x1EB6 * 8 + 0)
#define                                 ODCE0_bit           _BIT_ACCESS(ODCONE,0)
// ODCONE<ODCE1>
extern volatile __bit                   ODCE1               __at(0xF5B1);	// @ (0x1EB6 * 8 + 1)
#define                                 ODCE1_bit           _BIT_ACCESS(ODCONE,1)
// ODCONE<ODCE2>
extern volatile __bit                   ODCE2               __at(0xF5B2);	// @ (0x1EB6 * 8 + 2)
#define                                 ODCE2_bit           _BIT_ACCESS(ODCONE,2)
// DAC1CON<OE0>
extern volatile __bit                   OE0                 __at(0x8864);	// @ (0x110C * 8 + 4)
#define                                 OE0_bit             _BIT_ACCESS(DAC1CON,4)
// DAC1CON<OE1>
extern volatile __bit                   OE1                 __at(0x8865);	// @ (0x110C * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC1CON,5)
// ADSTAT<OV>
extern volatile __bit                   OV                  __at(0xE957);	// @ (0x1D2A * 8 + 7)
#define                                 OV_bit              _BIT_ACCESS(ADSTAT,7)
// CWG1STR<OVRA>
extern volatile __bit                   OVRA                __at(0x28A4);	// @ (0x514 * 8 + 4)
#define                                 OVRA_bit            _BIT_ACCESS(CWG1STR,4)
// CWG1STR<OVRB>
extern volatile __bit                   OVRB                __at(0x28A5);	// @ (0x514 * 8 + 5)
#define                                 OVRB_bit            _BIT_ACCESS(CWG1STR,5)
// CWG1STR<OVRC>
extern volatile __bit                   OVRC                __at(0x28A6);	// @ (0x514 * 8 + 6)
#define                                 OVRC_bit            _BIT_ACCESS(CWG1STR,6)
// CWG1STR<OVRD>
extern volatile __bit                   OVRD                __at(0x28A7);	// @ (0x514 * 8 + 7)
#define                                 OVRD_bit            _BIT_ACCESS(CWG1STR,7)
// CCP1CON<P1M1>
extern volatile __bit                   P1M1                __at(0x1C77);	// @ (0x38E * 8 + 7)
#define                                 P1M1_bit            _BIT_ACCESS(CCP1CON,7)
// CCP2CON<P2M1>
extern volatile __bit                   P2M1                __at(0x1C97);	// @ (0x392 * 8 + 7)
#define                                 P2M1_bit            _BIT_ACCESS(CCP2CON,7)
// CM1PCH<PCH0>
extern volatile __bit                   PCH0                __at(0x8478);	// @ (0x108F * 8 + 0)
#define                                 PCH0_bit            _BIT_ACCESS(CM1PCH,0)
// CM1PCH<PCH1>
extern volatile __bit                   PCH1                __at(0x8479);	// @ (0x108F * 8 + 1)
#define                                 PCH1_bit            _BIT_ACCESS(CM1PCH,1)
// CM1PCH<PCH2>
extern volatile __bit                   PCH2                __at(0x847A);	// @ (0x108F * 8 + 2)
#define                                 PCH2_bit            _BIT_ACCESS(CM1PCH,2)
// ADCON1<PCSC>
extern volatile __bit                   PCSC                __at(0xE939);	// @ (0x1D27 * 8 + 1)
#define                                 PCSC_bit            _BIT_ACCESS(ADCON1,1)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN1>
extern volatile __bit                   PEN1                __at(0x348A);	// @ (0x691 * 8 + 2)
#define                                 PEN1_bit            _BIT_ACCESS(SSP1CON2,2)
// SSP2CON2<PEN2>
extern volatile __bit                   PEN2                __at(0x34DA);	// @ (0x69B * 8 + 2)
#define                                 PEN2_bit            _BIT_ACCESS(SSP2CON2,2)
// NCO1CON<PFM>
extern volatile __bit                   PFM                 __at(0x2490);	// @ (0x492 * 8 + 0)
#define                                 PFM_bit             _BIT_ACCESS(NCO1CON,0)
// CWG1CON1<POLA>
extern volatile __bit                   POLA                __at(0x2888);	// @ (0x511 * 8 + 0)
#define                                 POLA_bit            _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<POLB>
extern volatile __bit                   POLB                __at(0x2889);	// @ (0x511 * 8 + 1)
#define                                 POLB_bit            _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<POLC>
extern volatile __bit                   POLC                __at(0x288A);	// @ (0x511 * 8 + 2)
#define                                 POLC_bit            _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<POLD>
extern volatile __bit                   POLD                __at(0x288B);	// @ (0x511 * 8 + 3)
#define                                 POLD_bit            _BIT_ACCESS(CWG1CON1,3)
// ADCON1<PPOL>
extern volatile __bit                   PPOL                __at(0xE93F);	// @ (0x1D27 * 8 + 7)
#define                                 PPOL_bit            _BIT_ACCESS(ADCON1,7)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0xF060);	// @ (0x1E0C * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// ADPREL<PRE0>
extern volatile __bit                   PRE0                __at(0xE920);	// @ (0x1D24 * 8 + 0)
#define                                 PRE0_bit            _BIT_ACCESS(ADPREL,0)
// ADPREL<PRE1>
extern volatile __bit                   PRE1                __at(0xE921);	// @ (0x1D24 * 8 + 1)
#define                                 PRE1_bit            _BIT_ACCESS(ADPREL,1)
// ADPREH<PRE10>
extern volatile __bit                   PRE10               __at(0xE92A);	// @ (0x1D25 * 8 + 2)
#define                                 PRE10_bit           _BIT_ACCESS(ADPREH,2)
// ADPREH<PRE11>
extern volatile __bit                   PRE11               __at(0xE92B);	// @ (0x1D25 * 8 + 3)
#define                                 PRE11_bit           _BIT_ACCESS(ADPREH,3)
// ADPREH<PRE12>
extern volatile __bit                   PRE12               __at(0xE92C);	// @ (0x1D25 * 8 + 4)
#define                                 PRE12_bit           _BIT_ACCESS(ADPREH,4)
// ADPREL<PRE2>
extern volatile __bit                   PRE2                __at(0xE922);	// @ (0x1D24 * 8 + 2)
#define                                 PRE2_bit            _BIT_ACCESS(ADPREL,2)
// ADPREL<PRE3>
extern volatile __bit                   PRE3                __at(0xE923);	// @ (0x1D24 * 8 + 3)
#define                                 PRE3_bit            _BIT_ACCESS(ADPREL,3)
// ADPREL<PRE4>
extern volatile __bit                   PRE4                __at(0xE924);	// @ (0x1D24 * 8 + 4)
#define                                 PRE4_bit            _BIT_ACCESS(ADPREL,4)
// ADPREL<PRE5>
extern volatile __bit                   PRE5                __at(0xE925);	// @ (0x1D24 * 8 + 5)
#define                                 PRE5_bit            _BIT_ACCESS(ADPREL,5)
// ADPREL<PRE6>
extern volatile __bit                   PRE6                __at(0xE926);	// @ (0x1D24 * 8 + 6)
#define                                 PRE6_bit            _BIT_ACCESS(ADPREL,6)
// ADPREL<PRE7>
extern volatile __bit                   PRE7                __at(0xE927);	// @ (0x1D24 * 8 + 7)
#define                                 PRE7_bit            _BIT_ACCESS(ADPREL,7)
// ADPREH<PRE8>
extern volatile __bit                   PRE8                __at(0xE928);	// @ (0x1D25 * 8 + 0)
#define                                 PRE8_bit            _BIT_ACCESS(ADPREH,0)
// ADPREH<PRE9>
extern volatile __bit                   PRE9                __at(0xE929);	// @ (0x1D25 * 8 + 1)
#define                                 PRE9_bit            _BIT_ACCESS(ADPREH,1)
// ADREF<PREF0>
extern volatile __bit                   PREF0               __at(0xE958);	// @ (0x1D2B * 8 + 0)
#define                                 PREF0_bit           _BIT_ACCESS(ADREF,0)
// ADREF<PREF1>
extern volatile __bit                   PREF1               __at(0xE959);	// @ (0x1D2B * 8 + 1)
#define                                 PREF1_bit           _BIT_ACCESS(ADREF,1)
// ADPREVL<PREV0>
extern volatile __bit                   PREV0               __at(0xE8D8);	// @ (0x1D1B * 8 + 0)
#define                                 PREV0_bit           _BIT_ACCESS(ADPREVL,0)
// ADPREVL<PREV1>
extern volatile __bit                   PREV1               __at(0xE8D9);	// @ (0x1D1B * 8 + 1)
#define                                 PREV1_bit           _BIT_ACCESS(ADPREVL,1)
// ADPREVH<PREV10>
extern volatile __bit                   PREV10              __at(0xE8E2);	// @ (0x1D1C * 8 + 2)
#define                                 PREV10_bit          _BIT_ACCESS(ADPREVH,2)
// ADPREVH<PREV11>
extern volatile __bit                   PREV11              __at(0xE8E3);	// @ (0x1D1C * 8 + 3)
#define                                 PREV11_bit          _BIT_ACCESS(ADPREVH,3)
// ADPREVH<PREV12>
extern volatile __bit                   PREV12              __at(0xE8E4);	// @ (0x1D1C * 8 + 4)
#define                                 PREV12_bit          _BIT_ACCESS(ADPREVH,4)
// ADPREVH<PREV13>
extern volatile __bit                   PREV13              __at(0xE8E5);	// @ (0x1D1C * 8 + 5)
#define                                 PREV13_bit          _BIT_ACCESS(ADPREVH,5)
// ADPREVH<PREV14>
extern volatile __bit                   PREV14              __at(0xE8E6);	// @ (0x1D1C * 8 + 6)
#define                                 PREV14_bit          _BIT_ACCESS(ADPREVH,6)
// ADPREVH<PREV15>
extern volatile __bit                   PREV15              __at(0xE8E7);	// @ (0x1D1C * 8 + 7)
#define                                 PREV15_bit          _BIT_ACCESS(ADPREVH,7)
// ADPREVL<PREV2>
extern volatile __bit                   PREV2               __at(0xE8DA);	// @ (0x1D1B * 8 + 2)
#define                                 PREV2_bit           _BIT_ACCESS(ADPREVL,2)
// ADPREVL<PREV3>
extern volatile __bit                   PREV3               __at(0xE8DB);	// @ (0x1D1B * 8 + 3)
#define                                 PREV3_bit           _BIT_ACCESS(ADPREVL,3)
// ADPREVL<PREV4>
extern volatile __bit                   PREV4               __at(0xE8DC);	// @ (0x1D1B * 8 + 4)
#define                                 PREV4_bit           _BIT_ACCESS(ADPREVL,4)
// ADPREVL<PREV5>
extern volatile __bit                   PREV5               __at(0xE8DD);	// @ (0x1D1B * 8 + 5)
#define                                 PREV5_bit           _BIT_ACCESS(ADPREVL,5)
// ADPREVL<PREV6>
extern volatile __bit                   PREV6               __at(0xE8DE);	// @ (0x1D1B * 8 + 6)
#define                                 PREV6_bit           _BIT_ACCESS(ADPREVL,6)
// ADPREVL<PREV7>
extern volatile __bit                   PREV7               __at(0xE8DF);	// @ (0x1D1B * 8 + 7)
#define                                 PREV7_bit           _BIT_ACCESS(ADPREVL,7)
// ADPREVH<PREV8>
extern volatile __bit                   PREV8               __at(0xE8E0);	// @ (0x1D1C * 8 + 0)
#define                                 PREV8_bit           _BIT_ACCESS(ADPREVH,0)
// ADPREVH<PREV9>
extern volatile __bit                   PREV9               __at(0xE8E1);	// @ (0x1D1C * 8 + 1)
#define                                 PREV9_bit           _BIT_ACCESS(ADPREVH,1)
// ADCON2<PSIS>
extern volatile __bit                   PSIS                __at(0xE947);	// @ (0x1D28 * 8 + 7)
#define                                 PSIS_bit            _BIT_ACCESS(ADCON2,7)
// DAC1CON<PSS0>
extern volatile __bit                   PSS0                __at(0x8862);	// @ (0x110C * 8 + 2)
#define                                 PSS0_bit            _BIT_ACCESS(DAC1CON,2)
// DAC1CON<PSS1>
extern volatile __bit                   PSS1                __at(0x8863);	// @ (0x110C * 8 + 3)
#define                                 PSS1_bit            _BIT_ACCESS(DAC1CON,3)
// PWM3CON<PWM3EN>
extern volatile __bit                   PWM3EN              __at(0x2077);	// @ (0x40E * 8 + 7)
#define                                 PWM3EN_bit          _BIT_ACCESS(PWM3CON,7)
// PWM3CON<PWM3OUT>
extern volatile __bit                   PWM3OUT             __at(0x2075);	// @ (0x40E * 8 + 5)
#define                                 PWM3OUT_bit         _BIT_ACCESS(PWM3CON,5)
// PWM3CON<PWM3POL>
extern volatile __bit                   PWM3POL             __at(0x2074);	// @ (0x40E * 8 + 4)
#define                                 PWM3POL_bit         _BIT_ACCESS(PWM3CON,4)
// PWM4CON<PWM4EN>
extern volatile __bit                   PWM4EN              __at(0x208F);	// @ (0x411 * 8 + 7)
#define                                 PWM4EN_bit          _BIT_ACCESS(PWM4CON,7)
// PWM4CON<PWM4OUT>
extern volatile __bit                   PWM4OUT             __at(0x208D);	// @ (0x411 * 8 + 5)
#define                                 PWM4OUT_bit         _BIT_ACCESS(PWM4CON,5)
// PWM4CON<PWM4POL>
extern volatile __bit                   PWM4POL             __at(0x208C);	// @ (0x411 * 8 + 4)
#define                                 PWM4POL_bit         _BIT_ACCESS(PWM4CON,4)
// PWM5CON<PWM5EN>
extern volatile __bit                   PWM5EN              __at(0x20A7);	// @ (0x414 * 8 + 7)
#define                                 PWM5EN_bit          _BIT_ACCESS(PWM5CON,7)
// PWM5CON<PWM5OUT>
extern volatile __bit                   PWM5OUT             __at(0x20A5);	// @ (0x414 * 8 + 5)
#define                                 PWM5OUT_bit         _BIT_ACCESS(PWM5CON,5)
// PWM5CON<PWM5POL>
extern volatile __bit                   PWM5POL             __at(0x20A4);	// @ (0x414 * 8 + 4)
#define                                 PWM5POL_bit         _BIT_ACCESS(PWM5CON,4)
// NCO1CLK<PWS0>
extern volatile __bit                   PWS0                __at(0x249D);	// @ (0x493 * 8 + 5)
#define                                 PWS0_bit            _BIT_ACCESS(NCO1CLK,5)
// NCO1CLK<PWS1>
extern volatile __bit                   PWS1                __at(0x249E);	// @ (0x493 * 8 + 6)
#define                                 PWS1_bit            _BIT_ACCESS(NCO1CLK,6)
// NCO1CLK<PWS2>
extern volatile __bit                   PWS2                __at(0x249F);	// @ (0x493 * 8 + 7)
#define                                 PWS2_bit            _BIT_ACCESS(NCO1CLK,7)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x64);	// @ (0xC * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x66);	// @ (0xC * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x67);	// @ (0xC * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x68);	// @ (0xD * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x69);	// @ (0xD * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x6A);	// @ (0xD * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x6B);	// @ (0xD * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x6C);	// @ (0xD * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x6E);	// @ (0xD * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x6F);	// @ (0xD * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x70);	// @ (0xE * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x71);	// @ (0xE * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PIE3<RC1IE>
extern volatile __bit                   RC1IE               __at(0x4CB);	// @ (0x99 * 8 + 3)
#define                                 RC1IE_bit           _BIT_ACCESS(PIE3,3)
// PIR3<RC1IF>
extern volatile __bit                   RC1IF               __at(0x47B);	// @ (0x8F * 8 + 3)
#define                                 RC1IF_bit           _BIT_ACCESS(PIR3,3)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x72);	// @ (0xE * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PIE3<RC2IE>
extern volatile __bit                   RC2IE               __at(0x4CD);	// @ (0x99 * 8 + 5)
#define                                 RC2IE_bit           _BIT_ACCESS(PIE3,5)
// PIR3<RC2IF>
extern volatile __bit                   RC2IF               __at(0x47D);	// @ (0x8F * 8 + 5)
#define                                 RC2IF_bit           _BIT_ACCESS(PIR3,5)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x73);	// @ (0xE * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x74);	// @ (0xE * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x75);	// @ (0xE * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x76);	// @ (0xE * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x77);	// @ (0xE * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// SSP1CON2<RCEN1>
extern volatile __bit                   RCEN1               __at(0x348B);	// @ (0x691 * 8 + 3)
#define                                 RCEN1_bit           _BIT_ACCESS(SSP1CON2,3)
// SSP2CON2<RCEN2>
extern volatile __bit                   RCEN2               __at(0x34DB);	// @ (0x69B * 8 + 3)
#define                                 RCEN2_bit           _BIT_ACCESS(SSP2CON2,3)
// NVMCON1<RD>
extern volatile __bit                   RD                  __at(0xE480);	// @ (0x1C90 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(NVMCON1,0)
// PORTD<RD0>
extern volatile __bit                   RD0                 __at(0x78);	// @ (0xF * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x79);	// @ (0xF * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// T1CON<RD161>
extern volatile __bit                   RD161               __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 RD161_bit           _BIT_ACCESS(T1CON,1)
// T3CON<RD163>
extern volatile __bit                   RD163               __at(0x14A1);	// @ (0x294 * 8 + 1)
#define                                 RD163_bit           _BIT_ACCESS(T3CON,1)
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x7A);	// @ (0xF * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x7B);	// @ (0xF * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x7C);	// @ (0xF * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// PORTD<RD5>
extern volatile __bit                   RD5                 __at(0x7D);	// @ (0xF * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// PORTD<RD6>
extern volatile __bit                   RD6                 __at(0x7E);	// @ (0xF * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// PORTD<RD7>
extern volatile __bit                   RD7                 __at(0x7F);	// @ (0xF * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// FVRCON<RDY>
extern volatile __bit                   RDY                 __at(0x8066);	// @ (0x100C * 8 + 6)
#define                                 RDY_bit             _BIT_ACCESS(FVRCON,6)
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x80);	// @ (0x10 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x81);	// @ (0x10 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x82);	// @ (0x10 * 8 + 2)
#define                                 RE2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// SSP1STAT<READ_WRITE1>
extern volatile __bit                   READ_WRITE1         __at(0x347A);	// @ (0x68F * 8 + 2)
#define                                 READ_WRITE1_bit     _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<READ_WRITE2>
extern volatile __bit                   READ_WRITE2         __at(0x34CA);	// @ (0x699 * 8 + 2)
#define                                 READ_WRITE2_bit     _BIT_ACCESS(SSP2STAT,2)
// DAC1CON<REFRNG>
extern volatile __bit                   REFRNG              __at(0x8866);	// @ (0x110C * 8 + 6)
#define                                 REFRNG_bit          _BIT_ACCESS(DAC1CON,6)
// CWG1AS0<REN>
extern volatile __bit                   REN                 __at(0x2896);	// @ (0x512 * 8 + 6)
#define                                 REN_bit             _BIT_ACCESS(CWG1AS0,6)
// ADRESL<RES0>
extern volatile __bit                   RES0                __at(0xE8E8);	// @ (0x1D1D * 8 + 0)
#define                                 RES0_bit            _BIT_ACCESS(ADRESL,0)
// ADRESL<RES1>
