GopalSaraf/Practicals/PSDL/include/proc/pic16f18075.h
extern volatile __bit                   RES1                __at(0xE8E9);	// @ (0x1D1D * 8 + 1)
#define                                 RES1_bit            _BIT_ACCESS(ADRESL,1)
// ADRESH<RES10>
extern volatile __bit                   RES10               __at(0xE8F2);	// @ (0x1D1E * 8 + 2)
#define                                 RES10_bit           _BIT_ACCESS(ADRESH,2)
// ADRESH<RES11>
extern volatile __bit                   RES11               __at(0xE8F3);	// @ (0x1D1E * 8 + 3)
#define                                 RES11_bit           _BIT_ACCESS(ADRESH,3)
// ADRESH<RES12>
extern volatile __bit                   RES12               __at(0xE8F4);	// @ (0x1D1E * 8 + 4)
#define                                 RES12_bit           _BIT_ACCESS(ADRESH,4)
// ADRESH<RES13>
extern volatile __bit                   RES13               __at(0xE8F5);	// @ (0x1D1E * 8 + 5)
#define                                 RES13_bit           _BIT_ACCESS(ADRESH,5)
// ADRESH<RES14>
extern volatile __bit                   RES14               __at(0xE8F6);	// @ (0x1D1E * 8 + 6)
#define                                 RES14_bit           _BIT_ACCESS(ADRESH,6)
// ADRESH<RES15>
extern volatile __bit                   RES15               __at(0xE8F7);	// @ (0x1D1E * 8 + 7)
#define                                 RES15_bit           _BIT_ACCESS(ADRESH,7)
// ADRESL<RES2>
extern volatile __bit                   RES2                __at(0xE8EA);	// @ (0x1D1D * 8 + 2)
#define                                 RES2_bit            _BIT_ACCESS(ADRESL,2)
// ADRESL<RES3>
extern volatile __bit                   RES3                __at(0xE8EB);	// @ (0x1D1D * 8 + 3)
#define                                 RES3_bit            _BIT_ACCESS(ADRESL,3)
// ADRESL<RES4>
extern volatile __bit                   RES4                __at(0xE8EC);	// @ (0x1D1D * 8 + 4)
#define                                 RES4_bit            _BIT_ACCESS(ADRESL,4)
// ADRESL<RES5>
extern volatile __bit                   RES5                __at(0xE8ED);	// @ (0x1D1D * 8 + 5)
#define                                 RES5_bit            _BIT_ACCESS(ADRESL,5)
// ADRESL<RES6>
extern volatile __bit                   RES6                __at(0xE8EE);	// @ (0x1D1D * 8 + 6)
#define                                 RES6_bit            _BIT_ACCESS(ADRESL,6)
// ADRESL<RES7>
extern volatile __bit                   RES7                __at(0xE8EF);	// @ (0x1D1D * 8 + 7)
#define                                 RES7_bit            _BIT_ACCESS(ADRESL,7)
// ADRESH<RES8>
extern volatile __bit                   RES8                __at(0xE8F0);	// @ (0x1D1E * 8 + 0)
#define                                 RES8_bit            _BIT_ACCESS(ADRESH,0)
// ADRESH<RES9>
extern volatile __bit                   RES9                __at(0xE8F1);	// @ (0x1D1E * 8 + 1)
#define                                 RES9_bit            _BIT_ACCESS(ADRESH,1)
// ADRPT<RPT0>
extern volatile __bit                   RPT0                __at(0xE8D0);	// @ (0x1D1A * 8 + 0)
#define                                 RPT0_bit            _BIT_ACCESS(ADRPT,0)
// ADRPT<RPT1>
extern volatile __bit                   RPT1                __at(0xE8D1);	// @ (0x1D1A * 8 + 1)
#define                                 RPT1_bit            _BIT_ACCESS(ADRPT,1)
// ADRPT<RPT2>
extern volatile __bit                   RPT2                __at(0xE8D2);	// @ (0x1D1A * 8 + 2)
#define                                 RPT2_bit            _BIT_ACCESS(ADRPT,2)
// ADRPT<RPT3>
extern volatile __bit                   RPT3                __at(0xE8D3);	// @ (0x1D1A * 8 + 3)
#define                                 RPT3_bit            _BIT_ACCESS(ADRPT,3)
// ADRPT<RPT4>
extern volatile __bit                   RPT4                __at(0xE8D4);	// @ (0x1D1A * 8 + 4)
#define                                 RPT4_bit            _BIT_ACCESS(ADRPT,4)
// ADRPT<RPT5>
extern volatile __bit                   RPT5                __at(0xE8D5);	// @ (0x1D1A * 8 + 5)
#define                                 RPT5_bit            _BIT_ACCESS(ADRPT,5)
// ADRPT<RPT6>
extern volatile __bit                   RPT6                __at(0xE8D6);	// @ (0x1D1A * 8 + 6)
#define                                 RPT6_bit            _BIT_ACCESS(ADRPT,6)
// ADRPT<RPT7>
extern volatile __bit                   RPT7                __at(0xE8D7);	// @ (0x1D1A * 8 + 7)
#define                                 RPT7_bit            _BIT_ACCESS(ADRPT,7)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0x3489);	// @ (0x691 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SSP2CON2<RSEN2>
extern volatile __bit                   RSEN2               __at(0x34D9);	// @ (0x69B * 8 + 1)
#define                                 RSEN2_bit           _BIT_ACCESS(SSP2CON2,1)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0x347A);	// @ (0x68F * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<RW2>
extern volatile __bit                   RW2                 __at(0x34CA);	// @ (0x699 * 8 + 2)
#define                                 RW2_bit             _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<R_W1>
extern volatile __bit                   R_W1                __at(0x347A);	// @ (0x68F * 8 + 2)
#define                                 R_W1_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_W2>
extern volatile __bit                   R_W2                __at(0x34CA);	// @ (0x699 * 8 + 2)
#define                                 R_W2_bit            _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<R_nW1>
extern volatile __bit                   R_nW1               __at(0x347A);	// @ (0x68F * 8 + 2)
#define                                 R_nW1_bit           _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_nW2>
extern volatile __bit                   R_nW2               __at(0x34CA);	// @ (0x699 * 8 + 2)
#define                                 R_nW2_bit           _BIT_ACCESS(SSP2STAT,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0xC6F);	// @ (0x18D * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SSP1CON2<SEN1>
extern volatile __bit                   SEN1                __at(0x3488);	// @ (0x691 * 8 + 0)
#define                                 SEN1_bit            _BIT_ACCESS(SSP1CON2,0)
// SSP2CON2<SEN2>
extern volatile __bit                   SEN2                __at(0x34D8);	// @ (0x69B * 8 + 0)
#define                                 SEN2_bit            _BIT_ACCESS(SSP2CON2,0)
// OSCSTAT<SFOR>
extern volatile __bit                   SFOR                __at(0x1081);	// @ (0x210 * 8 + 1)
#define                                 SFOR_bit            _BIT_ACCESS(OSCSTAT,1)
// CWG1AS0<SHUTDOWN>
extern volatile __bit                   SHUTDOWN            __at(0x2897);	// @ (0x512 * 8 + 7)
#define                                 SHUTDOWN_bit        _BIT_ACCESS(CWG1AS0,7)
// CLCSELECT<SLCT0>
extern volatile __bit                   SLCT0               __at(0x2CB0);	// @ (0x596 * 8 + 0)
#define                                 SLCT0_bit           _BIT_ACCESS(CLCSELECT,0)
// CLCSELECT<SLCT1>
extern volatile __bit                   SLCT1               __at(0x2CB1);	// @ (0x596 * 8 + 1)
#define                                 SLCT1_bit           _BIT_ACCESS(CLCSELECT,1)
// CLCSELECT<SLCT2>
extern volatile __bit                   SLCT2               __at(0x2CB2);	// @ (0x596 * 8 + 2)
#define                                 SLCT2_bit           _BIT_ACCESS(CLCSELECT,2)
// SLRCONA<SLRA0>
extern volatile __bit                   SLRA0               __at(0xF478);	// @ (0x1E8F * 8 + 0)
#define                                 SLRA0_bit           _BIT_ACCESS(SLRCONA,0)
// SLRCONA<SLRA1>
extern volatile __bit                   SLRA1               __at(0xF479);	// @ (0x1E8F * 8 + 1)
#define                                 SLRA1_bit           _BIT_ACCESS(SLRCONA,1)
// SLRCONA<SLRA2>
extern volatile __bit                   SLRA2               __at(0xF47A);	// @ (0x1E8F * 8 + 2)
#define                                 SLRA2_bit           _BIT_ACCESS(SLRCONA,2)
// SLRCONA<SLRA3>
extern volatile __bit                   SLRA3               __at(0xF47B);	// @ (0x1E8F * 8 + 3)
#define                                 SLRA3_bit           _BIT_ACCESS(SLRCONA,3)
// SLRCONA<SLRA4>
extern volatile __bit                   SLRA4               __at(0xF47C);	// @ (0x1E8F * 8 + 4)
#define                                 SLRA4_bit           _BIT_ACCESS(SLRCONA,4)
// SLRCONA<SLRA5>
extern volatile __bit                   SLRA5               __at(0xF47D);	// @ (0x1E8F * 8 + 5)
#define                                 SLRA5_bit           _BIT_ACCESS(SLRCONA,5)
// SLRCONA<SLRA6>
extern volatile __bit                   SLRA6               __at(0xF47E);	// @ (0x1E8F * 8 + 6)
#define                                 SLRA6_bit           _BIT_ACCESS(SLRCONA,6)
// SLRCONA<SLRA7>
extern volatile __bit                   SLRA7               __at(0xF47F);	// @ (0x1E8F * 8 + 7)
#define                                 SLRA7_bit           _BIT_ACCESS(SLRCONA,7)
// SLRCONB<SLRB0>
extern volatile __bit                   SLRB0               __at(0xF4C8);	// @ (0x1E99 * 8 + 0)
#define                                 SLRB0_bit           _BIT_ACCESS(SLRCONB,0)
// SLRCONB<SLRB1>
extern volatile __bit                   SLRB1               __at(0xF4C9);	// @ (0x1E99 * 8 + 1)
#define                                 SLRB1_bit           _BIT_ACCESS(SLRCONB,1)
// SLRCONB<SLRB2>
extern volatile __bit                   SLRB2               __at(0xF4CA);	// @ (0x1E99 * 8 + 2)
#define                                 SLRB2_bit           _BIT_ACCESS(SLRCONB,2)
// SLRCONB<SLRB3>
extern volatile __bit                   SLRB3               __at(0xF4CB);	// @ (0x1E99 * 8 + 3)
#define                                 SLRB3_bit           _BIT_ACCESS(SLRCONB,3)
// SLRCONB<SLRB4>
extern volatile __bit                   SLRB4               __at(0xF4CC);	// @ (0x1E99 * 8 + 4)
#define                                 SLRB4_bit           _BIT_ACCESS(SLRCONB,4)
// SLRCONB<SLRB5>
extern volatile __bit                   SLRB5               __at(0xF4CD);	// @ (0x1E99 * 8 + 5)
#define                                 SLRB5_bit           _BIT_ACCESS(SLRCONB,5)
// SLRCONB<SLRB6>
extern volatile __bit                   SLRB6               __at(0xF4CE);	// @ (0x1E99 * 8 + 6)
#define                                 SLRB6_bit           _BIT_ACCESS(SLRCONB,6)
// SLRCONB<SLRB7>
extern volatile __bit                   SLRB7               __at(0xF4CF);	// @ (0x1E99 * 8 + 7)
#define                                 SLRB7_bit           _BIT_ACCESS(SLRCONB,7)
// SLRCONC<SLRC0>
extern volatile __bit                   SLRC0               __at(0xF518);	// @ (0x1EA3 * 8 + 0)
#define                                 SLRC0_bit           _BIT_ACCESS(SLRCONC,0)
// SLRCONC<SLRC1>
extern volatile __bit                   SLRC1               __at(0xF519);	// @ (0x1EA3 * 8 + 1)
#define                                 SLRC1_bit           _BIT_ACCESS(SLRCONC,1)
// SLRCONC<SLRC2>
extern volatile __bit                   SLRC2               __at(0xF51A);	// @ (0x1EA3 * 8 + 2)
#define                                 SLRC2_bit           _BIT_ACCESS(SLRCONC,2)
// SLRCONC<SLRC3>
extern volatile __bit                   SLRC3               __at(0xF51B);	// @ (0x1EA3 * 8 + 3)
#define                                 SLRC3_bit           _BIT_ACCESS(SLRCONC,3)
// SLRCONC<SLRC4>
extern volatile __bit                   SLRC4               __at(0xF51C);	// @ (0x1EA3 * 8 + 4)
#define                                 SLRC4_bit           _BIT_ACCESS(SLRCONC,4)
// SLRCONC<SLRC5>
extern volatile __bit                   SLRC5               __at(0xF51D);	// @ (0x1EA3 * 8 + 5)
#define                                 SLRC5_bit           _BIT_ACCESS(SLRCONC,5)
// SLRCONC<SLRC6>
extern volatile __bit                   SLRC6               __at(0xF51E);	// @ (0x1EA3 * 8 + 6)
#define                                 SLRC6_bit           _BIT_ACCESS(SLRCONC,6)
// SLRCONC<SLRC7>
extern volatile __bit                   SLRC7               __at(0xF51F);	// @ (0x1EA3 * 8 + 7)
#define                                 SLRC7_bit           _BIT_ACCESS(SLRCONC,7)
// SLRCOND<SLRD0>
extern volatile __bit                   SLRD0               __at(0xF568);	// @ (0x1EAD * 8 + 0)
#define                                 SLRD0_bit           _BIT_ACCESS(SLRCOND,0)
// SLRCOND<SLRD1>
extern volatile __bit                   SLRD1               __at(0xF569);	// @ (0x1EAD * 8 + 1)
#define                                 SLRD1_bit           _BIT_ACCESS(SLRCOND,1)
// SLRCOND<SLRD2>
extern volatile __bit                   SLRD2               __at(0xF56A);	// @ (0x1EAD * 8 + 2)
#define                                 SLRD2_bit           _BIT_ACCESS(SLRCOND,2)
// SLRCOND<SLRD3>
extern volatile __bit                   SLRD3               __at(0xF56B);	// @ (0x1EAD * 8 + 3)
#define                                 SLRD3_bit           _BIT_ACCESS(SLRCOND,3)
// SLRCOND<SLRD4>
extern volatile __bit                   SLRD4               __at(0xF56C);	// @ (0x1EAD * 8 + 4)
#define                                 SLRD4_bit           _BIT_ACCESS(SLRCOND,4)
// SLRCOND<SLRD5>
extern volatile __bit                   SLRD5               __at(0xF56D);	// @ (0x1EAD * 8 + 5)
#define                                 SLRD5_bit           _BIT_ACCESS(SLRCOND,5)
// SLRCOND<SLRD6>
extern volatile __bit                   SLRD6               __at(0xF56E);	// @ (0x1EAD * 8 + 6)
#define                                 SLRD6_bit           _BIT_ACCESS(SLRCOND,6)
// SLRCOND<SLRD7>
extern volatile __bit                   SLRD7               __at(0xF56F);	// @ (0x1EAD * 8 + 7)
#define                                 SLRD7_bit           _BIT_ACCESS(SLRCOND,7)
// SLRCONE<SLRE0>
extern volatile __bit                   SLRE0               __at(0xF5B8);	// @ (0x1EB7 * 8 + 0)
#define                                 SLRE0_bit           _BIT_ACCESS(SLRCONE,0)
// SLRCONE<SLRE1>
extern volatile __bit                   SLRE1               __at(0xF5B9);	// @ (0x1EB7 * 8 + 1)
#define                                 SLRE1_bit           _BIT_ACCESS(SLRCONE,1)
// SLRCONE<SLRE2>
extern volatile __bit                   SLRE2               __at(0xF5BA);	// @ (0x1EB7 * 8 + 2)
#define                                 SLRE2_bit           _BIT_ACCESS(SLRCONE,2)
// SSP1STAT<SMP1>
extern volatile __bit                   SMP1                __at(0x347F);	// @ (0x68F * 8 + 7)
#define                                 SMP1_bit            _BIT_ACCESS(SSP1STAT,7)
// SSP2STAT<SMP2>
extern volatile __bit                   SMP2                __at(0x34CF);	// @ (0x699 * 8 + 7)
#define                                 SMP2_bit            _BIT_ACCESS(SSP2STAT,7)
// ADCON3<SOI>
extern volatile __bit                   SOI                 __at(0xE94B);	// @ (0x1D29 * 8 + 3)
#define                                 SOI_bit             _BIT_ACCESS(ADCON3,3)
// OSCSTAT<SOR>
extern volatile __bit                   SOR                 __at(0x1083);	// @ (0x210 * 8 + 3)
#define                                 SOR_bit             _BIT_ACCESS(OSCSTAT,3)
// OSCEN<SOSCEN>
extern volatile __bit                   SOSCEN              __at(0x108B);	// @ (0x211 * 8 + 3)
#define                                 SOSCEN_bit          _BIT_ACCESS(OSCEN,3)
// OSCCON3<SOSCPWR>
extern volatile __bit                   SOSCPWR             __at(0x107E);	// @ (0x20F * 8 + 6)
#define                                 SOSCPWR_bit         _BIT_ACCESS(OSCCON3,6)
// SSP1CLKPPS<SSP1CLKPPS0>
extern volatile __bit                   SSP1CLKPPS0         __at(0xF238);	// @ (0x1E47 * 8 + 0)
#define                                 SSP1CLKPPS0_bit     _BIT_ACCESS(SSP1CLKPPS,0)
// SSP1CLKPPS<SSP1CLKPPS1>
extern volatile __bit                   SSP1CLKPPS1         __at(0xF239);	// @ (0x1E47 * 8 + 1)
#define                                 SSP1CLKPPS1_bit     _BIT_ACCESS(SSP1CLKPPS,1)
// SSP1CLKPPS<SSP1CLKPPS2>
extern volatile __bit                   SSP1CLKPPS2         __at(0xF23A);	// @ (0x1E47 * 8 + 2)
#define                                 SSP1CLKPPS2_bit     _BIT_ACCESS(SSP1CLKPPS,2)
// SSP1CLKPPS<SSP1CLKPPS3>
extern volatile __bit                   SSP1CLKPPS3         __at(0xF23B);	// @ (0x1E47 * 8 + 3)
#define                                 SSP1CLKPPS3_bit     _BIT_ACCESS(SSP1CLKPPS,3)
// SSP1CLKPPS<SSP1CLKPPS4>
extern volatile __bit                   SSP1CLKPPS4         __at(0xF23C);	// @ (0x1E47 * 8 + 4)
#define                                 SSP1CLKPPS4_bit     _BIT_ACCESS(SSP1CLKPPS,4)
// SSP1CLKPPS<SSP1CLKPPS5>
extern volatile __bit                   SSP1CLKPPS5         __at(0xF23D);	// @ (0x1E47 * 8 + 5)
#define                                 SSP1CLKPPS5_bit     _BIT_ACCESS(SSP1CLKPPS,5)
// SSP1DATPPS<SSP1DATPPS0>
extern volatile __bit                   SSP1DATPPS0         __at(0xF240);	// @ (0x1E48 * 8 + 0)
#define                                 SSP1DATPPS0_bit     _BIT_ACCESS(SSP1DATPPS,0)
// SSP1DATPPS<SSP1DATPPS1>
extern volatile __bit                   SSP1DATPPS1         __at(0xF241);	// @ (0x1E48 * 8 + 1)
#define                                 SSP1DATPPS1_bit     _BIT_ACCESS(SSP1DATPPS,1)
// SSP1DATPPS<SSP1DATPPS2>
extern volatile __bit                   SSP1DATPPS2         __at(0xF242);	// @ (0x1E48 * 8 + 2)
#define                                 SSP1DATPPS2_bit     _BIT_ACCESS(SSP1DATPPS,2)
// SSP1DATPPS<SSP1DATPPS3>
extern volatile __bit                   SSP1DATPPS3         __at(0xF243);	// @ (0x1E48 * 8 + 3)
#define                                 SSP1DATPPS3_bit     _BIT_ACCESS(SSP1DATPPS,3)
// SSP1DATPPS<SSP1DATPPS4>
extern volatile __bit                   SSP1DATPPS4         __at(0xF244);	// @ (0x1E48 * 8 + 4)
#define                                 SSP1DATPPS4_bit     _BIT_ACCESS(SSP1DATPPS,4)
// SSP1DATPPS<SSP1DATPPS5>
extern volatile __bit                   SSP1DATPPS5         __at(0xF245);	// @ (0x1E48 * 8 + 5)
#define                                 SSP1DATPPS5_bit     _BIT_ACCESS(SSP1DATPPS,5)
// PIE3<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x4CE);	// @ (0x99 * 8 + 6)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE3,6)
// PIR3<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x47E);	// @ (0x8F * 8 + 6)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR3,6)
// SSP1SSPPS<SSP1SSPPS0>
extern volatile __bit                   SSP1SSPPS0          __at(0xF248);	// @ (0x1E49 * 8 + 0)
#define                                 SSP1SSPPS0_bit      _BIT_ACCESS(SSP1SSPPS,0)
// SSP1SSPPS<SSP1SSPPS1>
extern volatile __bit                   SSP1SSPPS1          __at(0xF249);	// @ (0x1E49 * 8 + 1)
#define                                 SSP1SSPPS1_bit      _BIT_ACCESS(SSP1SSPPS,1)
// SSP1SSPPS<SSP1SSPPS2>
extern volatile __bit                   SSP1SSPPS2          __at(0xF24A);	// @ (0x1E49 * 8 + 2)
#define                                 SSP1SSPPS2_bit      _BIT_ACCESS(SSP1SSPPS,2)
// SSP1SSPPS<SSP1SSPPS3>
extern volatile __bit                   SSP1SSPPS3          __at(0xF24B);	// @ (0x1E49 * 8 + 3)
#define                                 SSP1SSPPS3_bit      _BIT_ACCESS(SSP1SSPPS,3)
// SSP1SSPPS<SSP1SSPPS4>
extern volatile __bit                   SSP1SSPPS4          __at(0xF24C);	// @ (0x1E49 * 8 + 4)
#define                                 SSP1SSPPS4_bit      _BIT_ACCESS(SSP1SSPPS,4)
// SSP1SSPPS<SSP1SSPPS5>
extern volatile __bit                   SSP1SSPPS5          __at(0xF24D);	// @ (0x1E49 * 8 + 5)
#define                                 SSP1SSPPS5_bit      _BIT_ACCESS(SSP1SSPPS,5)
// PIE4<SSP2IE>
extern volatile __bit                   SSP2IE              __at(0x4D0);	// @ (0x9A * 8 + 0)
#define                                 SSP2IE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<SSP2IF>
extern volatile __bit                   SSP2IF              __at(0x480);	// @ (0x90 * 8 + 0)
#define                                 SSP2IF_bit          _BIT_ACCESS(PIR4,0)
// SSP1CON1<SSPEN1>
extern volatile __bit                   SSPEN1              __at(0x3485);	// @ (0x690 * 8 + 5)
#define                                 SSPEN1_bit          _BIT_ACCESS(SSP1CON1,5)
// SSP2CON1<SSPEN2>
extern volatile __bit                   SSPEN2              __at(0x34D5);	// @ (0x69A * 8 + 5)
#define                                 SSPEN2_bit          _BIT_ACCESS(SSP2CON1,5)
// SSP1CON1<SSPM01>
extern volatile __bit                   SSPM01              __at(0x3480);	// @ (0x690 * 8 + 0)
#define                                 SSPM01_bit          _BIT_ACCESS(SSP1CON1,0)
// SSP2CON1<SSPM02>
extern volatile __bit                   SSPM02              __at(0x34D0);	// @ (0x69A * 8 + 0)
#define                                 SSPM02_bit          _BIT_ACCESS(SSP2CON1,0)
// SSP1CON1<SSPM11>
extern volatile __bit                   SSPM11              __at(0x3481);	// @ (0x690 * 8 + 1)
#define                                 SSPM11_bit          _BIT_ACCESS(SSP1CON1,1)
// SSP2CON1<SSPM12>
extern volatile __bit                   SSPM12              __at(0x34D1);	// @ (0x69A * 8 + 1)
#define                                 SSPM12_bit          _BIT_ACCESS(SSP2CON1,1)
// SSP1CON1<SSPM21>
extern volatile __bit                   SSPM21              __at(0x3482);	// @ (0x690 * 8 + 2)
#define                                 SSPM21_bit          _BIT_ACCESS(SSP1CON1,2)
// SSP2CON1<SSPM22>
extern volatile __bit                   SSPM22              __at(0x34D2);	// @ (0x69A * 8 + 2)
#define                                 SSPM22_bit          _BIT_ACCESS(SSP2CON1,2)
// SSP1CON1<SSPM31>
extern volatile __bit                   SSPM31              __at(0x3483);	// @ (0x690 * 8 + 3)
#define                                 SSPM31_bit          _BIT_ACCESS(SSP1CON1,3)
// SSP2CON1<SSPM32>
extern volatile __bit                   SSPM32              __at(0x34D3);	// @ (0x69A * 8 + 3)
#define                                 SSPM32_bit          _BIT_ACCESS(SSP2CON1,3)
// SSP1CON1<SSPOV1>
extern volatile __bit                   SSPOV1              __at(0x3486);	// @ (0x690 * 8 + 6)
#define                                 SSPOV1_bit          _BIT_ACCESS(SSP1CON1,6)
// SSP2CON1<SSPOV2>
extern volatile __bit                   SSPOV2              __at(0x34D6);	// @ (0x69A * 8 + 6)
#define                                 SSPOV2_bit          _BIT_ACCESS(SSP2CON1,6)
// SSP1STAT<START1>
extern volatile __bit                   START1              __at(0x347B);	// @ (0x68F * 8 + 3)
#define                                 START1_bit          _BIT_ACCESS(SSP1STAT,3)
// SSP2STAT<START2>
extern volatile __bit                   START2              __at(0x34CB);	// @ (0x699 * 8 + 3)
#define                                 START2_bit          _BIT_ACCESS(SSP2STAT,3)
// ADSTAT<STAT0>
extern volatile __bit                   STAT0               __at(0xE950);	// @ (0x1D2A * 8 + 0)
#define                                 STAT0_bit           _BIT_ACCESS(ADSTAT,0)
// ADSTAT<STAT1>
extern volatile __bit                   STAT1               __at(0xE951);	// @ (0x1D2A * 8 + 1)
#define                                 STAT1_bit           _BIT_ACCESS(ADSTAT,1)
// ADSTAT<STAT2>
extern volatile __bit                   STAT2               __at(0xE952);	// @ (0x1D2A * 8 + 2)
#define                                 STAT2_bit           _BIT_ACCESS(ADSTAT,2)
// STATUS_SHAD<STATUS_SHAD0>
extern volatile __bit                   STATUS_SHAD0        __at(0xFF20);	// @ (0x1FE4 * 8 + 0)
#define                                 STATUS_SHAD0_bit    _BIT_ACCESS(STATUS_SHAD,0)
// STATUS_SHAD<STATUS_SHAD1>
extern volatile __bit                   STATUS_SHAD1        __at(0xFF21);	// @ (0x1FE4 * 8 + 1)
#define                                 STATUS_SHAD1_bit    _BIT_ACCESS(STATUS_SHAD,1)
// STATUS_SHAD<STATUS_SHAD2>
